Repository: khiari-youssef/SesaLife_Flutter
Catalog: infrastructure/localizations/lib/l10n/intl_*.arb
Languages: fr

source: Login
fr: Se connecter

source: Logout
fr: Se déconnecter

source: Go back
fr: Retourner

# device_auth_unsupported
source: Your device either does not have strong biometric authentication or you did not yet enroll one !
fr: Votre appareil ne supporte pas une forte authentification biometrique ! ou bien vous ne l'avez pas encore enregistré

# device_auth_action
source: This action requires authentication
fr: Cette action nécessite votre authentification

source: Guest space
fr: Espace visiteur

source: Phone
fr: Téléphone

source: Birthdate
fr: Date de naissance

source: FirstName
fr: Prénom

source: LastName
fr: Nom

source: Diploma
fr: Diplôme

# sex_male
source: Male
fr: Homme

# sex_female
source: Female
fr: Femme

source: Assigned classes
fr: Classes assignés

# student_class
source: class
fr: classe

source: company
fr: entreprise

source: User profiles
fr: Profiles utilisateurs

# diploma_choice_title
source: Choose your diploma :
fr: Choisissez votre diploma :

# work_opportunity_suggestion_title
source: Do you want to start a career in IT along with your education ?
fr: Voulez-vous commencer votre carrière professionnelle en poursuivant une formation en alternance ?

# work_opportunity_suggestion_description
source: Sesame university offers the possibility to get a job in IT company that will also be in charge of paying your yearly tuitions.
fr: L'université sésame vous offre la possiblité de travailler dans une entreprise prestigieuse qui prendra en charge les frais de la formation.

# work_opportunity_suggestion_accepted
source: Yes, i would like to learn more about it.
fr: Oui, je veux en savoir plus.

# work_opportunity_suggestion_rejected
source: No , iâ€™m not interested
fr: Non, je ne suis pas intéréssé.

# enrollment_submit_result_success_message
source: Your request has been submitted successfully ! you will receive a reply as soon as it gets reviewed !
fr: Votre demande de candidature a été soumise avec succés ! vous auriez une réponse le plut tot possible!

# enrollment_submit_result_error_unknown_message
source: Your request could not be submitted ! try again
fr: La soumission de votre demande a échoué ! ré-essayer !

# enrollment_submit_result_error_rejected_message
source: Your candidacy has been rejected !
fr: Votre demande de candidature a été rejeté !

source: Password
fr: Mot de passe

# programs_label
source: Programs
fr: Programmes

# registration_label
source: Registration
fr: Inscriptions

# privacy_policy_label
source: Privacy & Security policy
fr: Politique de securité & confidentialité

# terms_of_service_label
source: Terms of service
fr: Termes d'utilisation

# programs_desc
source: Learn more about the different curriculums offered by sesame university and future opportunities.
fr: Renseignez-vous sur les différentes formations fournis par l'université sésame.

# registration_desc
source: Fill the registration form with your personal data and your preferred program for candidacy.
fr: Remplir le formulaire d'inscription avec vos données personnelles et votre choix de formation pour la candidature

# privacy_policy_desc
source: Learn more about how the app uses and protects your personal data.
fr: Savoir plus sur la sécurité et l'usage de mes données personnelles collectés par l'application.

source: My personal details
fr: Mes données personnelles

source: Identity verification
fr: Vérification d'identitée

source: Quit
fr: Quitter

source: Cancel
fr: Annuler

source: Yes
fr: Oui

source: No
fr: Non

source: Confirm
fr: Confirmer

source: required
fr: obligatoire

# calendar_title
source: Semester {semester} timetable
fr: Calendrier du semestre {semester}

source: Settings
fr: Paramètres

source: My profile
fr: Mon profile

source: My badge
fr: Mon badge

# enrollment_notice_step1
source: If the email you entered is not already registered, we will you send an OTP code for re-authentication in order to proceed to the next steps.
fr: Si l'email que vous avez entré n'est pas encore utilisé, on vous enverra un code OTP de ré-authentification pour procéder à l'étape suivante.

# enrollment_code_verification_notice
source: An OTP code is sent via email to {email} And will expire in 10 minutes
fr: Un code OTP sera envoyé à {email} et sera expiré dans 10 minutes

# form_error_message_required_field
source: This field is required
fr: Ce champ est obligatoire !

# form_error_message_email_format
source: Invalid email format
fr: Adresse email invalide !

# form_error_message_phone_format
source: Invalid phone format
fr: Numéro de téléphone invalide !

# form_error_message_name_format
source: Invalid name format
fr: Nom invalide !

# error_profile_data_not_available_title
source: Profile data not available !
fr: Vos données ne sont pas disponibles !

# error_profile_data_not_available_message
source: Try logging-in again !
fr: Essayez de vous reconnecter

# profile_user
source: User
fr: Utilisateur

# profile_teacher
source: Teacher
fr: Enseignant

# profile_student
source: Student
fr: Etudiant

# profile_professional_student
source: Student
fr: Etudiant Alternant

# profile_badge
source: My Sesame badge
fr: Mon badge Sesame

# badge_click_to_scan
source: Click to scan
fr: Cliquer pour scanner

# badge_expired
source: Expired
fr: Expiré

source: Note
fr: Remarque

# badge_usage_notice
source: This badge carries your identiy informations, for security reasons, When you reveal your badge, it will only be visible for 10s
fr: Ce badge représente votre identité, pour des raisons de sécurité, votre badge n'est visible que pour 5s.

# badge_guideline_question
source: What is the badge used for ?
fr: Pourquoi utiliser le badge ?

# sessions_course
source: Course
fr: Cours

# sessions_exam
source: Exam
fr: Examens

# sessions_any
source: Session
fr: Scéance

# sessions_all
source: All
fr: Tous

# settings_stay_logged
source: Stay logged in
fr: Je veux rester connecté

# settings_hide_my_data
source: Hide my work informations
fr: Cacher mes données professionnelles

# settings_notify_me
source: Notify me about incoming events
fr: Je veux recevoir les notifications importantes

# profile_subscription
source: My subscription
fr: Mon abonnement

# profile_projects
source: My projects
fr: Mes projets

# profile_grades
source: My grades
fr: Mes notes

# profile_classes
source: My classes
fr: Mes classes

# payment_subscription_expected_date
source: Payment expected before {date}
fr: Paiement prévu avant le {date}

# payment_subscription_overdue
source: Payment overdue !
fr: Paiement en retard !

# payment_subscription_completion_date
source: Payment completed on {date}
fr: Paiement effectué le {date}

# payment_subscription_period
source: Subscription period :
fr: Période d'abonnement :

# payment_fee
source: Fee :
fr: Frais :

# payment_receipt_download
source: Download payment receipt
fr: Télécharger le récu de paiement

# payment_receipt_view
source: View payment receipt
fr: Voir le reçu de paiement

# payment_pay_now_action
source: Pay now
fr: Payer maintenant

source: Payment
fr: Paiement

# payment_method_choice_title
source: Select payment method :
fr: Choisissez un moyen de paiement :

# payment_method_cachOrBank
source: Cach / Bank check
fr: Espèce / Chèque bancaire

source: Pay
fr: Payer

# payment_card_holder_name
source: Card holder name
fr: Carte du proprietaire

# payment_card_number
source: Card number
fr: Numéro de carte

# payment_card_expiry_date
source: Expiry date
fr: Date d'exipration

# payment_credit_card_label
source: Credit card
fr: Carte bancaire

# payment_card_invalid_type
source: Credit Card Network Not recognized
fr: Carte de credit non reconnue

# payment_cc_input_required
source: required field !
fr: ce champ est requis!

# payment_cc_number_input_invalid
source: invalid credit card number !
fr: ce numéro de carte de crédit est invalide !

# payment_cc_cvv_input_invalid
source: invalid credit card CVV !
fr: ce code CVV est invalide !

# payment_cc_expiry_input_invalid
source: invalid credit card expiry date !
fr: cette date d'expiration est invalide

# payment_cc_holder_name_input_invalid
source: invalid credit card holder name!
fr: Nom invalide !

# payment_cashOrCheck_result_message
source: Payment status updated ! You will need to go to the university financial service office to validate your payment !
fr: Vous devez vous rendre au service financière pour valider le paiement !

# payment_credit_card_result_message_success
source: Payment completed ! your payment receipt will be ready as soon as possible !
fr: Payment effecuté ! vous pouvez récupérer le reçu de paiement dés qu'il sera prêt !

# payment_credit_card_result_message_error
source: Payment failed ! check your credit card informations or contact your bank for more details !
fr: Payment echoué ! vérifier les détails de votre carte de paiment ou bien contacter votre banque !

# payment_credit_card_save_data_request
source: Would you like to securely save or update your credit card details in your device ?
fr: Voulez-vous sauvegarder les données de votre carte bancaire localement en toute securité ?

# payment_credit_card_load_data_request
source: Would you like to securely load your credit card details from your device ?
fr: Voulez-vous utiliser les données existantes de votre carte bancaire en toute securité ?

# payment_cashOrCheck_result_trans_id
source: Transaction ID : {transid}
fr: Numéro de transaction : {transid}

# payment_cashOrCheck_result_datetime
source: Transaction occured on {data} at {time}
fr: La transaction a eu lieu le {data} à {time}

# users_search_placeholder
source: Search profiles by name ...
fr: Rechercher des profiles par nom ...

# sesame_classes_search_placeholder
source: Search classes by name ...
fr: Rechercher des classes par nom ...

# users_search_no_result
source: No search result !
fr: Pas de résultat !

# sesame_classes_groups
source: Groups
fr: Groupes
